<template>
  <div class="legalInfo">
    <div
        class="legalInfo__content"
        ref="legalInfo__content"
    >
      <div
          class="legalInfo__contentInner"
          ref="legalInfo__contentInner"
      >
        <div class="section">
          <div class="h2">
            Условия и правила акции
          </div>
          <ol>
            <li>
              Если у тебя есть учетная запись в Фогейме, то при пополнении лицевого счета ты можешь активировать специальный код и получить 13% от суммы пополнения бонусами Фогейма.
            </li>
            <li>
              Предложение действительно только для одного пополнения счета одной учетной записи в Фогейме.
            </li>
            <li>
              Акция проходит в период с 30 октября до 14 ноября, включая обе даты. По истечении указанного периода предложение недействительно, а это значит, активировать код будет более невозможно, а начисление бонусов прекратится
            </li>
            <li>
              Предложение ограничено территорией Российской Федерации, стран СНГ, Украины, Грузии.
            </li>
          </ol>
          <div class="h2">Cпециальные условия акции «Фогеймштейн»</div>
          <ol class="specialList">
            <li>
              <div class="h3">Общие положения.</div>
              <ol>
                <li>
                  Настоящие Специальные условия Акции (далее - «Специальные Условия») являются неотъемлемой частью Стандартных правил проведения Акции, опубликованных по адресу
                  <a target="_blank" href="https://ru.4game.com/docs/legal/events-general-rule/">https://ru.4game.com/docs/legal/events-general-rule</a> (далее – «Правила»). При наличии противоречий между условиями Правил и Специальных Условий, приоритет имеют настоящие Специальные Условия. Термины, используемые в настоящих Специальных Условиях, используются в том же значении, что и в Правилах, если не оговорено иное.
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Сроки проведения Акции.</div>
              <ol>
                <li>
                  Период проведения Акции: с 30 октября 2018 года по 13 ноября 2018 года (до 17-00 по московскому времени включительно), включая обе даты.
                </li>
                <li>
                  Дата определения Победителя Акции, 13 ноября 2018 г., с 19-30 до 20-00 по московскому времени.
                </li>
                <li>
                  Период выдачи Призов: с 14 ноября 2018 года до 14 декабря 2018 года (период выдачи Призов не включает в себя срок доставки Приза Победителю Акции).
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Место и способ проведения Акции.</div>
              <ol>
                <li>
                  Акция проводится посредством сети Интернет с использованием социальных сетей vk.com, facebook.com и сайта Организатора.
                </li>
                <li>
                  Территория проведения Акции: Российская Федерация, страны СНГ, Украина, Грузия.
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Информирование об Акции.</div>
              <ol>
                <li>
                  Информирование о правилах и сроках проведения Акции, Призах, в том числе публикация настоящих Специальных Условий, проводится посредством сети Интернет на сайте:
                  <a target="_blank" href="https://4gamestein.com">https://4gamestein.com</a>
                </li>
                <li>
                  Информирование о Победителях производится в аккаунте <a target="_blank" href="https://vk.com/4game_pro">https://vk.com/4game_pro</a> в социальной сети vk.com.
                </li>
                <li>
                  Связь с представителем Организатора Акции осуществляется посредством Формы связи социальной сети <a target="_blank" href="https://vk.com/4game_pro">https://vk.com/4game_pro</a> или <a target="_blank" href="https://ru.4gamesupport.com/">https://ru.4gamesupport.com</a>
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Участники Акции.</div>
              <ol>
                <li>
                  Участником Акции становится лицо, достигшее 18 лет, удовлетворяющее требованиям Правил, находящееся в пределах Территории, указанной в п. 3.2. настоящих Специальных Условий, а также зарегистрированное в одной из социальных сетей vk.com, facebook.com (далее - «Социальная сеть»), и имеющее открытый профиль в такой Социальной сети, и выполнившее действия, необходимые для участия в Акции (п. 6.1. ниже).
                </li>
                <li>
                  Идентификация Участника осуществляется по аккаунту в соответствующей Социальной сети.
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Порядок участия в Акции.</div>
              <ol>
                <li>
                  Лицам, желающим принять участие в Акции, необходимо выполнить все нижеуказанные действия в период, указанный в п. 2.1. Специальных Условий выше:
                  <ul>
                    <li>
                      В период проведения Акции, указанный в п. 2.1. настоящих Специальных Условий, на страницу 4gamestein.com загрузить свою фотографию и сделать её уникальный дизайн с помощью предложенных на данной странице инструментов и далее со своей страницы в любой Социальной сети сделать 1 (один) репост такой фотографии со страницы 4gamestein.com (используя уникальную ссылку, сгенерированную автоматически), используя #фогеймштейн как хештег. В случае, если у Участника есть учетные записи в нескольких Социальных сетях, Участник делает репост записи только в одной из них. Фотографии, обработанные в соответствии с настоящим пунктом, но не направленные путем репоста со страницы 4gamestein.com, а загруженные в Социальные сети с компьютера Участника даже при наличии хештега, для участия в Акции не принимаются.
                    </li>
                  </ul>
                </li>
                <li>
                  Использование указанных в п. 6.1. промо публикаций разрешается только для целей участия в Акции.
                </li>
                <li>
                  Репост, выполненный в соответствии с п.6.1. Специальных условий, должен оставаться на странице Участника в Социальной сети до окончания срока, указанного в п.2.2. Специальных условий.
                </li>
                <li>
                  Участник самостоятельно принимает решение об обнародовании своего изображения в Социальных сетях при участии в Акции и настоящим выражает свое явное согласие с обработкой и порядком репоста своего изображения в соответствии с п. 6.1. выше. Организатор не несет перед Участником ответственности в связи с обнародованием и дальнейшим использованием, в том числе, путем распространения в сети «Интернет», любыми третьими лицами изображения Участника
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">Победители Акции.</div>
              <ol>
                <li>
                  Победителем Акции становится лицо из числа Участников Акции, чей «репост» (запись на странице Социальной сети, выполненная согласно п.5.1. Специальных Условий) будет выбран методом произвольного выбора специального программного обеспечения, при этом используется следующий алгоритм:
                  <ul>
                    <li>
                      Определяется полный список Участников;
                    </li>
                    <li>
                      Составляется список Участников;
                    </li>
                    <li>
                      Данные вносятся в соответствующее программное обеспечение, выбранное Организатором, для определения случайным образом Победителя;
                    </li>
                    <li>
                      Программа выдает результаты случайным образом
                    </li>
                  </ul>
                </li>
                <li>
                  Количество Победителей: 1 (один).
                </li>
                <li>
                  Организатор свяжется с Победителем посредством личных сообщений в Социальной сети в течение 20 календарных дней с даты, указанной в п.2.2. Специальных Условий, в том числе с целью получения информации, необходимой для вручения Приза.
                  <br>
                  В случае возникновения каких-либо сложностей у Организатора или Победителя Акции, связанных с доставкой Приза (любой из его составляющих) Организатор Акции по согласованию с таким Победителем Акции в личном порядке выбирает альтернативный способ приобретения и/или доставки Приза и/или Организатор вправе заменить Приз или какую-либо (какие-либо) из составляющих Приза бонусами, начисляемыми на лицевой счет Победителя Акции в рамках Сервиса 4game по собственному усмотрению.
                </li>
                <li>
                  Участники Акции также имеют возможность самостоятельно ознакомиться с итогами Акции в группе социальной сети по адресу
                  <a target="_blank" href="https://vk.com/4game_pro">https://vk.com/4game_pro</a> и связаться с представителем Организатора в течение 20 календарных дней с даты, указанной в п.2.2. Специальных Условий
                </li>
                <li>
                  В том случае, если в срок, установленный в п. 7.3. Специальных Условий, представитель Организатора не может связаться с Победителем из-за настроек конфиденциальности аккаунта Победителя в Социальной сети и/или Победитель самостоятельно не вышел на связь, а также в иных случаях, уставленных Правилами, Приз признается невостребованным. Хранение невостребованного Приза не предусмотрено.
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">
                Призовой фонд (Приз) Акции.
              </div>
              <ol>
                <li>
                  Призовой фонд Акции предоставляется и вручается Организатором Акции Победителю в рамках Территории (п. 3.2. Специальных Условий).
                </li>
                <li>
                  Организатор Акции определяет характеристики Приза по своему усмотрению.
                </li>
                <li>
                  Выплата денежного эквивалента стоимости Приза, а также замена Приза не производится.
                </li>
                <li>
                  Возврат неиспользованной части Приза в денежном эквиваленте или замена неиспользованной части Приза не предусмотрена. Оплата Приза сверх суммы, указанной в п.8.1. Специальных Условий, не предусмотрена.
                </li>
              </ol>
            </li>
            <li>
              <div class="h3">
                Иные положения.
              </div>
              <ol>
                <li>
                  Организатор Акции оставляет за собой право в период проведения Акции дополнять и иным образом корректировать (изменять) Специальные Условия без какого-либо дополнительного уведомления. Измененная редакция будет доступна на месте текущей версии.
                </li>
                <li>
                  Организатор не несёт ответственности в случае, если Победитель не может осуществить получение Приза в порядке, установленном настоящими Специальными Условиями, по причинам, не связанным с выполнением Организатором своих обязанностей.
                </li>
              </ol>
            </li>
          </ol>
        </div>
      </div>
    </div>
    <button
        class="legalInfo__trigger"
        @click="toggleContent"
    >
      <ArrowIcon
          class="legalInfo__triggerIcon"
          :class="{
            legalInfo__triggerIcon_opened: isOpened
          }"
      />
      Условия акции
    </button>
  </div>
</template>

<script>
  import ArrowIcon from './assets/arrow.svg';

  export default {
    components: {ArrowIcon},
    props: {},
    data() {
      return {
        isOpened: false,
      }
    },

    methods: {
      toggleContent() {
        this.$refs.legalInfo__content.style.height = this.isOpened ? 0 : `${this.$refs.legalInfo__contentInner.clientHeight}px`;
        this.isOpened = !this.isOpened;
      }
    }
  };
</script>

<style scoped lang="scss" src="./index.scss"></style>
